УТ_для_edt/src/DataProcessors/CRM_РаботаСМессенджеромTelegram/CRM_РаботаСМессенджеромTelegram.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>CRM_РаботаСМессенджеромTelegram</name>
  <attributes>
    <name>Токен</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиБота</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиСервер</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПорт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПользователь</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроксиПароль</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

УТ_для_edt/src/Documents/CRM_СообщениеМессенджера/CRM_СообщениеМессенджера.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CRM_СообщениеМессенджера</name>
  <posting>Deny</posting>
  <attributes>
    <name>CRM_РольОтветственного</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СкрытьВАРМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ID_Пользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ID_Сообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСообщения</name>
    <type>
      <types>EnumRef.CRM_ВидыСообщенияМессенджера</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.CRM_СообщениеМессенджера</types>
    </type>
  </attributes>
  <attributes>
    <name>Контакт</name>
    <type>
      <types>DefinedType.КонтактВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Прочитано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.CRM_УчетныеЗаписиМессенджеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучателиПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Диалог</name>
    <type>
      <types>CatalogRef.CRM_Диалоги</types>
    </type>
  </attributes>
  <attributes>
    <name>СообщениеОснование</name>
    <type>
      <types>DocumentRef.CRM_СообщениеМессенджера</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Избранный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

УТ_для_edt/src/Catalogs/ВидыКонтактнойИнформации/ВидыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыКонтактнойИнформации</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>CRM_СправочникПартнерыЧастноеЛицо</name>
      <description>Контактная информация справочника &quot;Клиенты&quot; (для физических лиц)</description>
    </items>
    <items>
      <name>CRM_СправочникПартнерыКомпания</name>
      <description>Контактная информация справочника &quot;Клиенты&quot; (для юридических лиц)</description>
    </items>
    <items>
      <name>СправочникКонтактныеЛицаПартнеров</name>
      <description>Контактная информация справочника &quot;Контактные лица партнеров&quot;</description>
    </items>
    <items>
      <name>СправочникКонтрагенты</name>
      <description>Контактная информация справочника &quot;Контрагенты&quot;</description>
    </items>
    <items>
      <name>СправочникОрганизации</name>
      <description>Контактная информация справочника &quot;Организации&quot;</description>
    </items>
    <items>
      <name>СправочникПартнеры</name>
      <description>Контактная информация справочника &quot;Партнеры&quot;</description>
    </items>
    <items>
      <name>СправочникПользователи</name>
      <description>Контактная информация справочника &quot;Пользователи&quot;</description>
    </items>
    <items>
      <name>СправочникCRM_ПотенциальныеКлиенты</name>
      <description>Контактная информация справочника &quot;Потенциальные клиенты&quot;</description>
    </items>
    <items>
      <name>СправочникРегистрацииВНалоговомОргане</name>
      <description>Контактная информация справочника &quot;Регистрации в налоговом органе&quot;</description>
    </items>
    <items>
      <name>СправочникСклады</name>
      <description>Контактная информация справочника &quot;Склады&quot;</description>
    </items>
    <items>
      <name>СправочникТорговыеТочки</name>
      <description>Контактная информация справочника &quot;Торговые точки&quot;</description>
    </items>
    <items>
      <name>СправочникФизическиеЛица</name>
      <description>Контактная информация справочника &quot;Физические лица&quot;</description>
    </items>
  </predefined>
  <attributes>
    <name>ТолькоНациональныйАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидРедактирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоляДругое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьСтрануВПредставление</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапретитьРедактированиеПользователем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МожноИзменятьСпособРедактирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбязательноеЗаполнение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьКорректность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроверятьПоФИАС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводНесколькихЗначений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьРедактированиеТолькоВДиалоге</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкрыватьНеактуальныеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонCДобавочнымНомером</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>УказыватьОКТМО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранитьИсториюИзменений</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МеждународныйФорматАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИспользоватьДляОповещений</name>
    <comment>Использовать для оповещений</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ИмяПредопределенногоЭлемента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоВида</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяГруппы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсправлятьУстаревшиеАдреса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторДляФормул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаскаНомераТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВводитьНомерПоМаске</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартВнутреннийНомерТелефона</name>
    <comment>#1651 смарт: Лопато / Телефония. Хранение истории контактной информации пользователей</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартОписание</name>
    <comment>#1776 смарт: Ермаков 19.04.2024 / Телефон в карточке пользователя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Представления</name>
    <attributes>
      <name>КодЯзыка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/DataProcessors/CRM_РаботаСМессенджеромTelegram/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбязательныеМетодыПрограмногоИнтерфейса

Функция ПолучитьСообщения(УчетнаяЗапись) Экспорт
	
	СтруктураПараметровДоступа = CRM_РаботаСМессенджерамиСерверПовтИсп.СтруктураПараметровДоступа(УчетнаяЗапись);
	Если СтруктураПараметровДоступа = Неопределено Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	Токен = СтруктураПараметровДоступа.Токен;
	Ресурс = "/bot" + Токен + "/getUpdates";
	
	Если СтруктураПараметровДоступа.Свойство("НастройкиБота") Тогда
		МассивСтруктур =
			CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(СтруктураПараметровДоступа.НастройкиБота);
		НастройкиБота = Новый ДеревоЗначений;
		ЗаполнитьДеревоЗначенийИзМассиваСтруктур(НастройкиБота, МассивСтруктур);
		Если НастройкиБота.Строки.Количество() > 0 И (ЗначениеЗаполнено(НастройкиБота.Строки[0].Ответ)
			 ИЛИ НастройкиБота.Строки[0].Строки.Количество() > 0) Тогда
			ИспользуетсяАвтоБот = Истина;
		Иначе
			ИспользуетсяАвтоБот = Ложь;
		КонецЕсли;
	Иначе
		ИспользуетсяАвтоБот = Ложь;
	КонецЕсли;

	СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос("api.telegram.org",
		 "",
		Ресурс, СтруктураПараметровДоступа.ПараметрыПрокси));
	
	МассивСообщений = Новый Массив;
	ПолученоПустое = Ложь;
	Пока Не ПолученоПустое Цикл
		Если НЕ СтруктураОтвета.ok Тогда
			ВызватьИсключение СтруктураОтвета.description;
		Иначе
			Если СтруктураОтвета.result.Количество() = 0 Тогда
				ПолученоПустое = Истина;
				Продолжить;
			КонецЕсли;
			Для каждого Обновление Из СтруктураОтвета.result Цикл
				Если Обновление.Свойство("message") Тогда
					user_id = Формат(Обновление.message.from.id, "ЧГ=");
					Если Обновление.message.Свойство("text") Тогда
						ТекстСообщения = СтрЗаменить(Обновление.message.text, "<br>", Символы.ПС);
					Иначе
						ТекстСообщения = "";
					КонецЕсли;
					Дата = МестноеВремя(Дата(1970, 1, 1) + Обновление.message.date);
					Сообщение = CRM_РаботаСМессенджерамиСервер.СтруктураСообщенияМесенджера();
					Контакт = CRM_РаботаСМессенджерамиСерверПовтИсп.НайтиКонтактПоКонтактнойИнформации(ПредставлениеКонтактнойИнформацииПользователя(user_id),
						УчетнаяЗапись, Перечисления.ТипыКонтактнойИнформации.ВебСтраница);
					ИмяПользователя = Обновление.message.from.first_name 
						+ ?(Обновление.message.from.Свойство("last_name"), " " + Обновление.message.from.last_name, "");
					Сообщение.Дата = Дата;
					Сообщение.ID_Сообщения = Формат(Обновление.message.message_id, "ЧГ=");
					Если ЗначениеЗаполнено(ТекстСообщения) Тогда
						Сообщение.ТекстСообщения = ТекстСообщения;
					КонецЕсли;
					Сообщение.ВидСообщения = "Входящее";
					Сообщение.ID_Пользователя = user_id;
					Если ЗначениеЗаполнено(Контакт) Тогда
						Сообщение.Контакт = Контакт;
					КонецЕсли;
					Сообщение.КонтактПредставление = ИмяПользователя;
					Если Обновление.message.Свойство("reply_to_message") Тогда
						Сообщение.ID_СообщенияОснования = Формат(Обновление.message.reply_to_message.message_id, "ЧГ=");
					КонецЕсли;
					Если Обновление.message.Свойство("document") Тогда
						Документ = Обновление.message.document;
						КаталогВременныхФайлов = КаталогВременныхФайлов();
						РесурсЗагрузкиФайла = "/bot" + Токен + "/getFile?file_id=" + Документ.file_id;
						СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос("api.telegram.org",
							 "",
							РесурсЗагрузкиФайла, СтруктураПараметровДоступа.ПараметрыПрокси));
						Если НЕ СтруктураОтвета.ok Тогда
							ВызватьИсключение СтруктураОтвета.description;
						Иначе
							Если СтруктураПараметровДоступа.ПараметрыПрокси <> Неопределено Тогда
								HTTPПрокси = Новый ИнтернетПрокси;	
								HTTPПрокси.Установить("https", СтруктураПараметровДоступа.ПараметрыПрокси.Сервер,
									 СтруктураПараметровДоступа.ПараметрыПрокси.Порт,
									СтруктураПараметровДоступа.ПараметрыПрокси.Пользователь, СтруктураПараметровДоступа.ПараметрыПрокси.Пароль, Ложь); 
							Иначе
								HTTPПрокси = Неопределено;
							КонецЕсли;

							ПутьКФайлу = СтруктураОтвета.result.file_path;
							Соединение = Новый HTTPСоединение("api.telegram.org", , , , HTTPПрокси, 20, Новый ЗащищенноеСоединениеOpenSSL);
							Соединение.Получить("/file/bot" + Токен + "/" + ПутьКФайлу, КаталогВременныхФайлов + Документ.file_name);
							Данные = Новый ДвоичныеДанные(КаталогВременныхФайлов + Документ.file_name);
							АдресФайлаВХранилище = ПоместитьВоВременноеХранилище(Данные);
							ПараметрыФайла = Новый Структура;
							ПараметрыФайла.Вставить("ВладелецФайлов", Неопределено);
							ПараметрыФайла.Вставить("Автор", Неопределено);
							ПараметрыФайла.Вставить("ИмяБезРасширения", Лев(Документ.file_name, СтрНайти(Документ.file_name, ".") - 1));
							ПараметрыФайла.Вставить("РасширениеБезТочки", Сред(Документ.file_name, СтрНайти(Документ.file_name, ".") + 1));
							ПараметрыФайла.Вставить("ВремяИзменения", Неопределено);
							ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное", Неопределено);
							ПараметрыФайла.Вставить("АдресФайлаВХранилище", АдресФайлаВХранилище);
							Сообщение.Вложения.Добавить(ПараметрыФайла);
							УдалитьФайлы(КаталогВременныхФайлов + Документ.file_name);
						КонецЕсли;
					КонецЕсли;
					Если Обновление.message.Свойство("photo") Тогда
						file_id = Обновление.message.photo[Обновление.message.photo.Количество() - 1].file_id;
						КаталогВременныхФайлов = КаталогВременныхФайлов();
						РесурсЗагрузкиФайла = "/bot" + Токен + "/getFile?file_id=" + file_id;
						СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос("api.telegram.org",
							 "",
							РесурсЗагрузкиФайла, СтруктураПараметровДоступа.ПараметрыПрокси));
						Если НЕ СтруктураОтвета.ok Тогда
							ВызватьИсключение СтруктураОтвета.description;
						Иначе
							Если СтруктураПараметровДоступа.ПараметрыПрокси <> Неопределено Тогда
								HTTPПрокси = Новый ИнтернетПрокси;	
								HTTPПрокси.Установить("https", СтруктураПараметровДоступа.ПараметрыПрокси.Сервер,
									 СтруктураПараметровДоступа.ПараметрыПрокси.Порт,
									СтруктураПараметровДоступа.ПараметрыПрокси.Пользователь, СтруктураПараметровДоступа.ПараметрыПрокси.Пароль, Ложь); 
							Иначе
								HTTPПрокси = Неопределено;
							КонецЕсли;

							ПутьКФайлу = СтруктураОтвета.result.file_path;
							ИмяФайла = Сред(СтруктураОтвета.result.file_path, СтрНайти(СтруктураОтвета.result.file_path, "/") + 1);
							Соединение = Новый HTTPСоединение("api.telegram.org", , , , HTTPПрокси, 20, Новый ЗащищенноеСоединениеOpenSSL);
							Соединение.Получить("/file/bot" + Токен + "/" + ПутьКФайлу, КаталогВременныхФайлов + ИмяФайла);
							Данные = Новый ДвоичныеДанные(КаталогВременныхФайлов + ИмяФайла);
							АдресФайлаВХранилище = ПоместитьВоВременноеХранилище(Данные);
							ПараметрыФайла = Новый Структура;
							ПараметрыФайла.Вставить("ВладелецФайлов", Неопределено);
							ПараметрыФайла.Вставить("Автор", Неопределено);
							ПараметрыФайла.Вставить("ИмяБезРасширения", Лев(ИмяФайла, СтрНайти(ИмяФайла, ".") - 1));
							ПараметрыФайла.Вставить("РасширениеБезТочки", Сред(ИмяФайла, СтрНайти(ИмяФайла, ".") + 1));
							ПараметрыФайла.Вставить("ВремяИзменения", Неопределено);
							ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное", Неопределено);
							ПараметрыФайла.Вставить("АдресФайлаВХранилище", АдресФайлаВХранилище);
							Сообщение.Вложения.Добавить(ПараметрыФайла);
							УдалитьФайлы(КаталогВременныхФайлов + ИмяФайла);
						КонецЕсли;
					КонецЕсли;
					Если Обновление.message.Свойство("video") Тогда
						file_id = Обновление.message.video.file_id;
						КаталогВременныхФайлов = КаталогВременныхФайлов();
						РесурсЗагрузкиФайла = "/bot" + Токен + "/getFile?file_id=" + file_id;
						СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос("api.telegram.org",
							 "",
							РесурсЗагрузкиФайла, СтруктураПараметровДоступа.ПараметрыПрокси));
						Если НЕ СтруктураОтвета.ok Тогда
							ВызватьИсключение СтруктураОтвета.description;
						Иначе
							Если СтруктураПараметровДоступа.ПараметрыПрокси <> Неопределено Тогда
								HTTPПрокси = Новый ИнтернетПрокси;	
								HTTPПрокси.Установить("https", СтруктураПараметровДоступа.ПараметрыПрокси.Сервер,
									 СтруктураПараметровДоступа.ПараметрыПрокси.Порт,
									СтруктураПараметровДоступа.ПараметрыПрокси.Пользователь, СтруктураПараметровДоступа.ПараметрыПрокси.Пароль, Ложь); 
							Иначе
								HTTPПрокси = Неопределено;
							КонецЕсли;

							ПутьКФайлу = СтруктураОтвета.result.file_path;
							ИмяФайла = Сред(СтруктураОтвета.result.file_path, СтрНайти(СтруктураОтвета.result.file_path, "/") + 1);
							Соединение = Новый HTTPСоединение("api.telegram.org", , , , HTTPПрокси, 20, Новый ЗащищенноеСоединениеOpenSSL);
							Соединение.Получить("/file/bot" + Токен + "/" + ПутьКФайлу, КаталогВременныхФайлов + ИмяФайла);
							Данные = Новый ДвоичныеДанные(КаталогВременныхФайлов + ИмяФайла);
							АдресФайлаВХранилище = ПоместитьВоВременноеХранилище(Данные);
							ПараметрыФайла = Новый Структура;
							ПараметрыФайла.Вставить("ВладелецФайлов", Неопределено);
							ПараметрыФайла.Вставить("Автор", Неопределено);
							ПараметрыФайла.Вставить("ИмяБезРасширения", Лев(ИмяФайла, СтрНайти(ИмяФайла, ".") - 1));
							ПараметрыФайла.Вставить("РасширениеБезТочки", Сред(ИмяФайла, СтрНайти(ИмяФайла, ".") + 1));
							ПараметрыФайла.Вставить("ВремяИзменения", Неопределено);
							ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное", Неопределено);
							ПараметрыФайла.Вставить("АдресФайлаВХранилище", АдресФайлаВХранилище);
							Сообщение.Вложения.Добавить(ПараметрыФайла);
							УдалитьФайлы(КаталогВременныхФайлов + ИмяФайла);
						КонецЕсли;
					КонецЕсли;
					Если ИспользуетсяАвтоБот И ЗначениеЗаполнено(ТекстСообщения) Тогда
						СсылкаСообщения = Документы.CRM_СообщениеМессенджера.ПолучитьСсылку();
						Сообщение.Вставить("Ссылка", СсылкаСообщения);
						ОбработатьДействиеБота(УчетнаяЗапись, ТекстСообщения, user_id, Контакт, ИмяПользователя, НастройкиБота);
					КонецЕсли;
					МассивСообщений.Добавить(Сообщение);
				ИначеЕсли Обновление.Свойство("callback_query") Тогда
					user_id = Формат(Обновление.callback_query.from.id, "ЧГ=");
					Если Обновление.callback_query.Свойство("data") Тогда
						ТекстСообщения = СтрЗаменить(Обновление.callback_query.data, "<br>", Символы.ПС);
					Иначе
						ТекстСообщения = "";
					КонецЕсли;
					Дата = ТекущаяДата();
					Сообщение = CRM_РаботаСМессенджерамиСервер.СтруктураСообщенияМесенджера();
					Контакт = CRM_РаботаСМессенджерамиСерверПовтИсп.НайтиКонтактПоКонтактнойИнформации(ПредставлениеКонтактнойИнформацииПользователя(user_id),
						УчетнаяЗапись, Перечисления.ТипыКонтактнойИнформации.ВебСтраница);
					ИмяПользователя = Обновление.callback_query.from.first_name 
						+ ?(Обновление.callback_query.from.Свойство("last_name"), " " + Обновление.callback_query.from.last_name, "");
					Сообщение.Дата = Дата;
					Сообщение.ID_Сообщения = Формат(Обновление.callback_query.id, "ЧГ=");
					Если ЗначениеЗаполнено(ТекстСообщения) Тогда
						Сообщение.ТекстСообщения = СтрЗаменить(Обновление.callback_query.data, "<br>", Символы.ПС);
					КонецЕсли;
					Сообщение.ВидСообщения = "Входящее";
					Сообщение.ID_Пользователя = user_id;
					Если ЗначениеЗаполнено(Контакт) Тогда
						Сообщение.Контакт = Контакт;
					КонецЕсли;
					Сообщение.КонтактПредставление = ИмяПользователя;
					Если ИспользуетсяАвтоБот И ЗначениеЗаполнено(ТекстСообщения) Тогда
						СсылкаСообщения = Документы.CRM_СообщениеМессенджера.ПолучитьСсылку();
						Сообщение.Вставить("Ссылка", СсылкаСообщения);
						РесурсЗагрузкиФайла = "/bot" + Токен + "/EditMessageReplyMarkup?chat_id=" 
							+ Формат(Обновление.callback_query.message.chat.id, "ЧГ=") + "&message_id=" + Формат(Обновление.callback_query.message.message_id, "ЧГ=");
						СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос("api.telegram.org",
							 "",
							РесурсЗагрузкиФайла, СтруктураПараметровДоступа.ПараметрыПрокси));
						ОбработатьДействиеБота(УчетнаяЗапись, ТекстСообщения, user_id, Контакт, ИмяПользователя, НастройкиБота);
					КонецЕсли;
					МассивСообщений.Добавить(Сообщение);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос("api.telegram.org",
			 "",
			Ресурс + "?offset=" + Формат(Обновление.update_id + 1, "ЧГ="), СтруктураПараметровДоступа.ПараметрыПрокси));
	КонецЦикла;	
	Возврат МассивСообщений;
	
КонецФункции

Функция ОтправитьСообщение(Сообщение, УчетнаяЗапись, IDПользователя, СписокФайлов, ДопПараметры) Экспорт
	
	// +Рарус alexpr
	//Возврат CRM_ЛицензированиеЭкспортныеМетоды.ПолучитьЗащищеннуюОбработку().ОтправитьСообщениеМессенджера(Сообщение,
	//	 УчетнаяЗапись, IDПользователя, СписокФайлов,
	//	 ДопПараметры);
	Возврат CRM_ЛицензированиеЭкспортныеМетодыНовый.ПолучитьЗащищеннуюОбработку().ОтправитьСообщениеМессенджера(Сообщение,
		 УчетнаяЗапись, IDПользователя, СписокФайлов,
		 ДопПараметры);
	// -Рарус alexpr
	
КонецФункции

Процедура ОжиданиеСобытий(УчетнаяЗапись, ОднаИтерация = Ложь) Экспорт
	СтруктураПараметровДоступа = CRM_РаботаСМессенджерамиСерверПовтИсп.СтруктураПараметровДоступа(УчетнаяЗапись);
	Токен = СтруктураПараметровДоступа.Токен;
	Ресурс = "/bot" + Токен + "/getUpdates";
	
	Если СтруктураПараметровДоступа.Свойство("НастройкиБота") Тогда
		МассивСтруктур =
			CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(СтруктураПараметровДоступа.НастройкиБота);
		НастройкиБота = Новый ДеревоЗначений;
		ЗаполнитьДеревоЗначенийИзМассиваСтруктур(НастройкиБота, МассивСтруктур);
		Если НастройкиБота.Строки.Количество() > 0 И (ЗначениеЗаполнено(НастройкиБота.Строки[0].Ответ)
			 ИЛИ НастройкиБота.Строки[0].Строки.Количество() > 0) Тогда
			ИспользуетсяАвтоБот = Истина;
		Иначе
			ИспользуетсяАвтоБот = Ложь;
		КонецЕсли;
	Иначе
		ИспользуетсяАвтоБот = Ложь;
	КонецЕсли;

	СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос("api.telegram.org",
		 "",
		Ресурс, СтруктураПараметровДоступа.ПараметрыПрокси));
			
	ПолученоПустое = Ложь;
	Пока Истина Цикл
		Если НЕ СтруктураОтвета.ok Тогда
			ВызватьИсключение СтруктураОтвета.description;
		Иначе
			МассивСообщений = Новый Массив;
			Для каждого Обновление Из СтруктураОтвета.result Цикл
				Если Обновление.Свойство("message") Тогда
					user_id = Формат(Обновление.message.from.id, "ЧГ=");
					Если Обновление.message.Свойство("text") Тогда
						ТекстСообщения = СтрЗаменить(Обновление.message.text, "<br>", Символы.ПС);
					Иначе
						ТекстСообщения = "";
					КонецЕсли;
					Дата = МестноеВремя(Дата(1970, 1, 1) + Обновление.message.date);
					Сообщение = CRM_РаботаСМессенджерамиСервер.СтруктураСообщенияМесенджера();
					Контакт = CRM_РаботаСМессенджерамиСерверПовтИсп.НайтиКонтактПоКонтактнойИнформации(ПредставлениеКонтактнойИнформацииПользователя(user_id),
						УчетнаяЗапись, Перечисления.ТипыКонтактнойИнформации.ВебСтраница);
					ИмяПользователя = Обновление.message.from.first_name 
						+ ?(Обновление.message.from.Свойство("last_name"), " " + Обновление.message.from.last_name, "");
					Сообщение.Дата = Дата;
					Сообщение.ID_Сообщения = Формат(Обновление.message.message_id, "ЧГ=");
					Если ЗначениеЗаполнено(ТекстСообщения) Тогда
						Сообщение.ТекстСообщения = ТекстСообщения;
					КонецЕсли;
					Сообщение.ВидСообщения = "Входящее";
					Сообщение.ID_Пользователя = user_id;
					Если ЗначениеЗаполнено(Контакт) Тогда
						Сообщение.Контакт = Контакт;
					КонецЕсли;
					Сообщение.КонтактПредставление = ИмяПользователя;
					Если Обновление.message.Свойство("reply_to_message") Тогда
						Сообщение.ID_СообщенияОснования = Формат(Обновление.message.reply_to_message.message_id, "ЧГ=");
					КонецЕсли;
					Если Обновление.message.Свойство("document") Тогда
						Документ = Обновление.message.document;
						КаталогВременныхФайлов = КаталогВременныхФайлов();
						РесурсЗагрузкиФайла = "/bot" + Токен + "/getFile?file_id=" + Документ.file_id;
						СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос("api.telegram.org",
							 "",
							РесурсЗагрузкиФайла, СтруктураПараметровДоступа.ПараметрыПрокси));
						Если НЕ СтруктураОтвета.ok Тогда
							ВызватьИсключение СтруктураОтвета.description;
						Иначе
							Если СтруктураПараметровДоступа.ПараметрыПрокси <> Неопределено Тогда
								HTTPПрокси = Новый ИнтернетПрокси;	
								HTTPПрокси.Установить("https", СтруктураПараметровДоступа.ПараметрыПрокси.Сервер,
									 СтруктураПараметровДоступа.ПараметрыПрокси.Порт,
									СтруктураПараметровДоступа.ПараметрыПрокси.Пользователь, СтруктураПараметровДоступа.ПараметрыПрокси.Пароль, Ложь); 
							Иначе
								HTTPПрокси = Неопределено;
							КонецЕсли;

							ПутьКФайлу = СтруктураОтвета.result.file_path;
							Соединение = Новый HTTPСоединение("api.telegram.org", , , , HTTPПрокси, 20, Новый ЗащищенноеСоединениеOpenSSL);
							Соединение.Получить("/file/bot" + Токен + "/" + ПутьКФайлу, КаталогВременныхФайлов + Документ.file_name);
							//КопироватьФайл("https://api.telegram.org/file/bot"+Токен+"/"+ПутьКФайлу,
								// КаталогВременныхФайлов
								//+Документ.file_name);
							Данные = Новый ДвоичныеДанные(КаталогВременныхФайлов + Документ.file_name);
							АдресФайлаВХранилище = ПоместитьВоВременноеХранилище(Данные);
							ПараметрыФайла = Новый Структура;
							ПараметрыФайла.Вставить("ВладелецФайлов", Неопределено);
							ПараметрыФайла.Вставить("Автор", Неопределено);
							ПараметрыФайла.Вставить("ИмяБезРасширения", Лев(Документ.file_name, СтрНайти(Документ.file_name, ".") - 1));
							ПараметрыФайла.Вставить("РасширениеБезТочки", Сред(Документ.file_name, СтрНайти(Документ.file_name, ".") + 1));
							ПараметрыФайла.Вставить("ВремяИзменения", Неопределено);
							ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное", Неопределено);
							ПараметрыФайла.Вставить("АдресФайлаВХранилище", АдресФайлаВХранилище);
							Сообщение.Вложения.Добавить(ПараметрыФайла);
							УдалитьФайлы(КаталогВременныхФайлов + Документ.file_name);
						КонецЕсли;
					КонецЕсли;
					Если Обновление.message.Свойство("photo") Тогда
						file_id = Обновление.message.photo[Обновление.message.photo.Количество() - 1].file_id;
						КаталогВременныхФайлов = КаталогВременныхФайлов();
						РесурсЗагрузкиФайла = "/bot" + Токен + "/getFile?file_id=" + file_id;
						СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос("api.telegram.org",
							 "",
							РесурсЗагрузкиФайла, СтруктураПараметровДоступа.ПараметрыПрокси));
						Если НЕ СтруктураОтвета.ok Тогда
							ВызватьИсключение СтруктураОтвета.description;
						Иначе
							Если СтруктураПараметровДоступа.ПараметрыПрокси <> Неопределено Тогда
								HTTPПрокси = Новый ИнтернетПрокси;	
								HTTPПрокси.Установить("https", СтруктураПараметровДоступа.ПараметрыПрокси.Сервер,
									 СтруктураПараметровДоступа.ПараметрыПрокси.Порт,
									СтруктураПараметровДоступа.ПараметрыПрокси.Пользователь, СтруктураПараметровДоступа.ПараметрыПрокси.Пароль, Ложь); 
							Иначе
								HTTPПрокси = Неопределено;
							КонецЕсли;

							ПутьКФайлу = СтруктураОтвета.result.file_path;
							ИмяФайла = Сред(СтруктураОтвета.result.file_path, СтрНайти(СтруктураОтвета.result.file_path, "/") + 1);
							Соединение = Новый HTTPСоединение("api.telegram.org", , , , HTTPПрокси, 20, Новый ЗащищенноеСоединениеOpenSSL);
							Соединение.Получить("/file/bot" + Токен + "/" + ПутьКФайлу, КаталогВременныхФайлов + ИмяФайла);
							//КопироватьФайл("https://api.telegram.org/file/bot"+Токен+"/"+ПутьКФайлу, КаталогВременныхФайлов+ИмяФайла);
							Данные = Новый ДвоичныеДанные(КаталогВременныхФайлов + ИмяФайла);
							АдресФайлаВХранилище = ПоместитьВоВременноеХранилище(Данные);
							ПараметрыФайла = Новый Структура;
							ПараметрыФайла.Вставить("ВладелецФайлов", Неопределено);
							ПараметрыФайла.Вставить("Автор", Неопределено);
							ПараметрыФайла.Вставить("ИмяБезРасширения", Лев(ИмяФайла, СтрНайти(ИмяФайла, ".") - 1));
							ПараметрыФайла.Вставить("РасширениеБезТочки", Сред(ИмяФайла, СтрНайти(ИмяФайла, ".") + 1));
							ПараметрыФайла.Вставить("ВремяИзменения", Неопределено);
							ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное", Неопределено);
							ПараметрыФайла.Вставить("АдресФайлаВХранилище", АдресФайлаВХранилище);
							Сообщение.Вложения.Добавить(ПараметрыФайла);
							УдалитьФайлы(КаталогВременныхФайлов + ИмяФайла);
						КонецЕсли;
					КонецЕсли;
					Если ИспользуетсяАвтоБот И ЗначениеЗаполнено(ТекстСообщения) Тогда
						СсылкаСообщения = Документы.CRM_СообщениеМессенджера.ПолучитьСсылку();
						Сообщение.Вставить("Ссылка", СсылкаСообщения);
						ОбработатьДействиеБота(УчетнаяЗапись, ТекстСообщения, user_id, Контакт, ИмяПользователя, НастройкиБота);
					КонецЕсли;
					МассивСообщений.Добавить(Сообщение);
				ИначеЕсли Обновление.Свойство("callback_query") Тогда
					user_id = Формат(Обновление.callback_query.from.id, "ЧГ=");
					Если Обновление.callback_query.Свойство("data") Тогда
						ТекстСообщения = СтрЗаменить(Обновление.callback_query.data, "<br>", Символы.ПС);
					Иначе
						ТекстСообщения = "";
					КонецЕсли;
					Дата = ТекущаяДата();
					Сообщение = CRM_РаботаСМессенджерамиСервер.СтруктураСообщенияМесенджера();
					Контакт = CRM_РаботаСМессенджерамиСерверПовтИсп.НайтиКонтактПоКонтактнойИнформации(ПредставлениеКонтактнойИнформацииПользователя(user_id),
						УчетнаяЗапись, Перечисления.ТипыКонтактнойИнформации.ВебСтраница);
					ИмяПользователя = Обновление.callback_query.from.first_name 
						+ ?(Обновление.callback_query.from.Свойство("last_name"), " " + Обновление.callback_query.from.last_name, "");
					Сообщение.Дата = Дата;
					Сообщение.ID_Сообщения = Формат(Обновление.callback_query.id, "ЧГ=");
					Если ЗначениеЗаполнено(ТекстСообщения) Тогда
						Сообщение.ТекстСообщения = СтрЗаменить(Обновление.callback_query.data, "<br>", Символы.ПС);
					КонецЕсли;
					Сообщение.ВидСообщения = "Входящее";
					Сообщение.ID_Пользователя = user_id;
					Если ЗначениеЗаполнено(Контакт) Тогда
						Сообщение.Контакт = Контакт;
					КонецЕсли;
					Сообщение.КонтактПредставление = ИмяПользователя;
					Если ИспользуетсяАвтоБот И ЗначениеЗаполнено(ТекстСообщения) Тогда
						СсылкаСообщения = Документы.CRM_СообщениеМессенджера.ПолучитьСсылку();
						Сообщение.Вставить("Ссылка", СсылкаСообщения);
						РесурсЗагрузкиФайла = "/bot" + Токен + "/EditMessageReplyMarkup?chat_id=" 
							+ Формат(Обновление.callback_query.message.chat.id, "ЧГ=") + "&message_id=" + Формат(Обновление.callback_query.message.message_id, "ЧГ=");
						СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос("api.telegram.org",
							 "",
							РесурсЗагрузкиФайла, СтруктураПараметровДоступа.ПараметрыПрокси));
						БотОтветил = ОбработатьДействиеБота(УчетнаяЗапись, ТекстСообщения, user_id, Контакт,
							 ИмяПользователя,
							 НастройкиБота);
					КонецЕсли;
					МассивСообщений.Добавить(Сообщение);
				КонецЕсли;
			КонецЦикла;
			CRM_РаботаСМессенджерамиСервер.СоздатьСообщенияИзПолученныхДанных(УчетнаяЗапись, МассивСообщений);
		КонецЕсли;
		
		Если ОднаИтерация Тогда
			Прервать;
		КонецЕсли;
		
		Если СтруктураОтвета.result.Количество() > 0 Тогда
			Оффсет = "&offset=" + Формат(Обновление.update_id + 1, "ЧГ=");
		Иначе
			Оффсет = "";
		КонецЕсли;
		
		СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос("api.telegram.org",
			 "",
			Ресурс + "?timeout=20" + Оффсет, СтруктураПараметровДоступа.ПараметрыПрокси));
	КонецЦикла;	
КонецПроцедуры

Функция ПолучитьВидКИМессенджера(Контакт) Экспорт
	
	Наименование = "Telegram";
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВидыКонтактнойИнформации.Ссылка КАК Ссылка,
	                      |	ВидыКонтактнойИнформации.ПометкаУдаления КАК ПометкаУдаления
	                      |ИЗ
	                      |	Справочник.ВидыКонтактнойИнформации КАК ВидыКонтактнойИнформации
	                      |ГДЕ
	                      |	ВидыКонтактнойИнформации.Наименование = &Наименование
	                      |	И ВидыКонтактнойИнформации.Тип = &Тип
	                      |	И ВидыКонтактнойИнформации.Родитель = &Родитель");
	
	Если ТипЗнч(Контакт) = Тип("СправочникСсылка.Партнеры") Тогда
		Родитель = Справочники.ВидыКонтактнойИнформации.CRM_СправочникПартнерыЧастноеЛицо;
	ИначеЕсли ТипЗнч(Контакт) = Тип("СправочникСсылка.КонтактныеЛицаПартнеров") Тогда
		Родитель = Справочники.ВидыКонтактнойИнформации.СправочникКонтактныеЛицаПартнеров;
	ИначеЕсли ТипЗнч(Контакт) = Тип("СправочникСсылка.CRM_ПотенциальныеКлиенты") Тогда
		Родитель = Справочники.ВидыКонтактнойИнформации.СправочникCRM_ПотенциальныеКлиенты;
	КонецЕсли;
	
	ТипКИ = ТипКИМессенджера();
	
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Тип", ТипКИ);
	Запрос.УстановитьПараметр("Родитель", Родитель);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.ПометкаУдаления Тогда
			Выборка.Ссылка.ПолучитьОбъект().УстановитьПометкуУдаления(Ложь);
		КонецЕсли;
		Возврат Выборка.Ссылка;
	Иначе
		УстановитьПривилегированныйРежим(Истина);
		НовыйВидКИ = Справочники.ВидыКонтактнойИнформации.СоздатьЭлемент();
		НовыйВидКИ.Родитель = Родитель;
		НовыйВидКИ.Наименование = Наименование;
		НовыйВидКИ.Тип = ТипКИ;
		НовыйВидКИ.Используется = Истина;
		НовыйВидКИ.ВидРедактирования = "Диалог";
		НовыйВидКИ.Записать();
		УстановитьПривилегированныйРежим(Ложь);
		Возврат НовыйВидКИ.Ссылка;
	КонецЕсли;
	
КонецФункции

Функция ТипКИМессенджера() Экспорт
	
	Возврат Перечисления.ТипыКонтактнойИнформации.ВебСтраница;
	
КонецФункции

Функция НачалоАдресаСтраницыПользователя() Экспорт
	Возврат "https://t.me/";
КонецФункции

Функция ПутьКДиалогуВБраузере(Структура) Экспорт
	Возврат Неопределено;
КонецФункции

Функция ПредставлениеКонтактнойИнформацииПользователя(ID_Пользователя) Экспорт
	Возврат НачалоАдресаСтраницыПользователя() + ID_Пользователя;
КонецФункции

Функция ВозможноИзменениеСообщений() Экспорт
	Возврат Истина; 
КонецФункции

Функция ИспользуютсяВложения() Экспорт
	Возврат Истина; 
КонецФункции

Функция HTMLКонтекста(УчетнаяЗапись, idПользователя, idГруппы) Экспорт
	Возврат Неопределено; 
КонецФункции

Функция Отключиться(СтруктураПараметровДоступа) Экспорт
	Возврат Истина;
КонецФункции

Процедура ПометитьКакПрочтенные(УчетнаяЗапись, МассивСообщений) Экспорт
	
КонецПроцедуры

Функция ПользовательДоступен(УчетнаяЗапись, ДополнительныеДанные) Экспорт
	
	Возврат Новый Структура("Доступен, Описание", Ложь, "");
	
КонецФункции

Функция ПараметрыМессенджера() Экспорт
	
    ПараметрыМессенджера = CRM_РаботаСМессенджерамиСерверПовтИсп.СтруктураПараметровМессенджера();
	
	Возврат ПараметрыМессенджера;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СлужебныеМетоды

Функция ДанныеБотаTelegram(Токен, Прокси) Экспорт
	Ресурс = "/bot" + Токен + "/getMe";
	СтруктураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьЗначениеИзОтветаJSON(CRM_РаботаСМессенджерамиСервер.ВыполнитьЗапрос("api.telegram.org",
		 "", Ресурс,
		 Прокси));
	Если НЕ СтруктураОтвета.ok Тогда
		ВызватьИсключение СтруктураОтвета.description;
	Иначе
		СтруктураРезультата = Новый Структура("Наименование, ИмяПользователя, id");
		СтруктураРезультата.Наименование = СтруктураОтвета.result.first_name;
		СтруктураРезультата.ИмяПользователя = СтруктураОтвета.result.username;
		СтруктураРезультата.id = СтруктураОтвета.result.id;
		Возврат СтруктураРезультата;
	КонецЕсли;
КонецФункции

Функция ОбработатьДействиеБота(УчетнаяЗапись, ТекстСообщения, user_id, Контакт, ИмяПользователя, НастройкиБота)
		
	Строка = НастройкиБота.Строки.Найти(ТекстСообщения, "callback_data", Истина);
	Если Строка <> Неопределено Тогда
		ТекстОтвета = Строка.Ответ;
		МассивКнопок = СтрокиДереваЗначенийВМассивСтруктур(Строка.Строки, "text, callback_data");
		КлавиатураОтвета = CRM_РаботаСМессенджерамиСервер.ПолучитьСтрокуJSON(Новый Структура("inline_keyboard",
			 МассивКнопок),
			 Истина);	
		ДопПараметры = Новый Структура("reply_markup", КлавиатураОтвета);
		ПараметрыДиалога = Новый Структура("ID_Пользователя, Группа, УчетнаяЗапись, Контакт,
			| ГруппаПредставление, КонтактПредставление",
			user_id, "", УчетнаяЗапись, Контакт, "", ИмяПользователя);
		CRM_РаботаСМессенджерамиСервер.ОтправитьСообщение(ТекстОтвета, ПараметрыДиалога, , , ДопПараметры);
		Если ТекстСообщения = "/start" Тогда
			Результат = Ложь;
		Иначе
			Результат = Истина;
		КонецЕсли;
	Иначе	
		Результат = Ложь;
	КонецЕсли;
	Возврат Результат;
	
КонецФункции

Функция СтрокиДереваЗначенийВМассивСтруктур(Строки, ИменаКолонок = "")
	Результат = Новый Массив;
	
	Для Каждого Строка Из Строки Цикл
		МассивКнопок = Новый Массив;
		СтруктураСтроки = Новый Структура(ИменаКолонок);
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, Строка);
		МассивКнопок.Добавить(СтруктураСтроки);
		Результат.Добавить(МассивКнопок);
	КонецЦикла;
	
	Возврат Результат;
КонецФункции

Процедура ЗаполнитьДеревоЗначенийИзМассиваСтруктур(Дерево, МассивСтруктур) 
	Если ТипЗнч(Дерево) = Тип("ДеревоЗначений") Тогда 
		СтруктураКолонок = МассивСтруктур[0];
		Для Каждого Поле Из СтруктураКолонок Цикл
			Если Поле.Ключ = "Строки" Тогда
				Продолжить;
			КонецЕсли;
			Если Дерево.Колонки.Найти(Поле.Ключ) = Неопределено Тогда
				Дерево.Колонки.Добавить(Поле.Ключ);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли; 
	Для Каждого Строка Из МассивСтруктур Цикл
		СтрокаДЗ = Дерево.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаДЗ, Строка);
		ЗаполнитьДеревоЗначенийИзМассиваСтруктур(СтрокаДЗ, Строка.Строки);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
